#include <stdio.h>

struct Student {
    const char* name;
    int inf;
    int math;
    int phys;
    int prog;
};

int main() {
    Student s[10] = {
        {"Іванчук С.О.", 4,3,3,4},
        {"Панченко І.А.", 5,4,4,5},
        {"Заєць О.М.", 3,4,4,4},
        {"Вельбицький П.О.", 4,3,3,3},
        {"Сидоренко В.Р.", 2,3,3,2},
        {"Кравченко З.І.", 3,5,4,5},
        {"Якубів Р.Н.", 5,4,4,3},
        {"Зоренко П.М.", 4,2,3,3},
        {"Берестяк Г.С.", 4,5,5,5},
        {"Дячик Н.С.", 5,5,4,4}
    };

    int i;
    int sum = 0;
    for(i=0;i<10;i++){
        printf("%2d. %-20s %d\n", i+1, s[i].name, s[i].math);
        sum += s[i].math;
    }
    printf("Середній бал групи з вищої математики: %.2f\n", sum/10.0);
    return 0;
}